
*** Expectation of Continuous Random Variables
\label{sub:Expectation-of-Continuous}

For a continuous random variable \(X\) the expected value of \(g(X)\) is
\begin{equation}
\E g(X)=\int_{x\in S}g(x)f_{X}(x)\:\mathrm{d} x,
\end{equation}
provided the (potentially improper) integral \(\int_{S}|g(x)|\, f(x)\mathrm{d} x\) is convergent. One important example is the mean \(\mu\), also known as \(\E X\):
\begin{equation}
\mu=\E X=\int_{x\in S}xf_{X}(x)\:\mathrm{d} x,
\end{equation}
provided \(\int_{S}|x|f(x)\mathrm{d} x\) is finite. Also there is the variance
\begin{equation}
\sigma^{2}=\E(X-\mu)^{2}=\int_{x\in S}(x-\mu)^{2}f_{X}(x)\,\mathrm{d} x,
\end{equation}
which can be computed with the alternate formula \(\sigma^{2}=\E X^{2}-(\E X)^{2}\). In addition, there is the standard deviation \(\sigma=\sqrt{\sigma^{2}}\). The moment generating function is given by
\begin{equation}
M_{X}(t)=\E\:\mathrm{e}^{tX}=\int_{-\infty}^{\infty}\mathrm{e}^{tx}f_{X}(x)\:\mathrm{d} x,
\end{equation}
provided the integral exists (is finite) for all \(t\) in a neighborhood of \(t=0\).

#+latex: \begin{example}
\label{exa:cont-pdf3x2}

Let the continuous random variable \(X\) have PDF
\[
f_{X}(x)=3x^{2},\quad0\leq x\leq 1.
\]
We will see later that \(f_{X}\) belongs to the /Beta/ family of distributions. It is easy to see that \(\int_{-\infty}^{\infty}f(x)\mathrm{d} x=1\).
\begin{align*}
\int_{-\infty}^{\infty}f_{X}(x)\mathrm{d} x & =\int_{0}^{1}3x^{2}\:\mathrm{d} x\\
 & =\left.x^{3}\right|_{x=0}^{1}\\
 & =1^{3}-0^{3}\\
 & =1.
\end{align*}
This being said, we may find \(\P(0.14\leq X<0.71)\).
\begin{align*}
\P(0.14\leq X<0.71) & =\int_{0.14}^{0.71}3x^{2}\mathrm{d} x,\\
 & =\left.x^{3}\right|_{x=0.14}^{0.71}\\
 & =0.71^{3}-0.14^{3}\\
 & \approx0.355167.
\end{align*}
We can find the mean and variance in an identical manner.
\begin{align*}
\mu=\int_{-\infty}^{\infty}xf_{X}(x)\mathrm{d} x & =\int_{0}^{1}x\cdot3x^{2}\:\mathrm{d} x,\\
 & =\frac{3}{4}x^{4}|_{x=0}^{1},\\
 & =\frac{3}{4}.
\end{align*}
It would perhaps be best to calculate the variance with the shortcut formula \(\sigma^{2}=\E X^{2}-\mu^{2}\):
\begin{align*}
\E X^{2}=\int_{-\infty}^{\infty}x^{2}f_{X}(x)\mathrm{d} x & =\int_{0}^{1}x^{2}\cdot3x^{2}\:\mathrm{d} x\\
 & =\left.\frac{3}{5}x^{5}\right|_{x=0}^{1}\\
 & =3/5.
\end{align*}
which gives \(\sigma^{2}=3/5-(3/4)^{2}=3/80\).
#+latex: \end{example}

#+latex: \begin{example}
\label{exa:cont-pdf-3x4}

We will try one with unbounded support to brush up on improper integration. Let the random variable \(X\) have PDF
\[
f_{X}(x)=\frac{3}{x^{4}},\quad x>1.
\]
We can show that \(\int_{-\infty}^{\infty}f(x)\mathrm{d} x=1\):
\begin{align*}
\int_{-\infty}^{\infty}f_{X}(x)\mathrm{d} x & =\int_{1}^{\infty}\frac{3}{x^{4}}\:\mathrm{d} x\\
 & =\lim_{t\to\infty}\int_{1}^{t}\frac{3}{x^{4}}\:\mathrm{d} x\\
 & =\lim_{t\to\infty}\ \left.3\,\frac{1}{-3}x^{-3}\right|_{x=1}^{t}\\
 & =-\left(\lim_{t\to\infty}\frac{1}{t^{3}}-1\right)\\
 & =1.
\end{align*}
We calculate \(\P(3.4\leq X<7.1)\):
\begin{align*}
\P(3.4\leq X<7.1) & =\int_{3.4}^{7.1}3x^{-4}\mathrm{d} x\\
 & =\left.3\,\frac{1}{-3}x^{-3}\right|_{x=3.4}^{7.1}\\
 & =-1(7.1^{-3}-3.4^{-3})\\
 & \approx0.0226487123.
\end{align*}
We locate the mean and variance just like before.
\begin{align*}
\mu=\int_{-\infty}^{\infty}xf_{X}(x)\mathrm{d} x & =\int_{1}^{\infty}x\cdot\frac{3}{x^{4}}\:\mathrm{d} x\\
 & =\left.3\,\frac{1}{-2}x^{-2}\right|_{x=1}^{\infty}\\
 & =-\frac{3}{2}\left(\lim_{t\to\infty}\frac{1}{t^{2}}-1\right)\\
 & =\frac{3}{2}.
\end{align*}
Again we use the shortcut \(\sigma^{2}=\E X^{2}-\mu^{2}\):
\begin{align*}
\E X^{2}=\int_{-\infty}^{\infty}x^{2}f_{X}(x)\mathrm{d} x & =\int_{1}^{\infty}x^{2}\cdot\frac{3}{x^{4}}\:\mathrm{d} x\\
 & =\left.3\:\frac{1}{-1}x^{-1}\right|_{x=1}^{\infty}\\
 & =-3\left(\lim_{t\to\infty}\frac{1}{t^{2}}-1\right)\\
 & =3,
\end{align*}
which closes the example with \(\sigma^{2}=3-(3/2)^{2}=3/4\).
#+latex: \end{example}

#+latex: \paragraph*{How to do it with \textsf{R}}

There exist utilities to calculate probabilities and expectations for general continuous random variables, but it is better to find a built-in model, if possible. Sometimes it is not possible. We show how to do it the long way, and the =distr=\index{R packages@\textsf{R} packages!distr@\texttt{distr}} package way.

#+latex: \begin{example}
Let \(X\) have PDF \(f(x)=3x^{2}\), \(0<x<1\) and find \(\P(0.14\leq X\leq0.71)\). (We will ignore that \(X\) is a beta random variable for the sake of argument.)

#+begin_src R :exports both :results output pp 
f <- function(x) 3*x^2
integrate(f, lower = 0.14, upper = 0.71)
#+end_src

#+results[ff04b010bf2bff9ce770336ec39edd4fd4d531e1]:
: 0.355167 with absolute error < 3.9e-15

Compare this to the answer we found in Example \ref{exa:cont-pdf3x2}. We could integrate the function \(xf(x)=\) =3*x^3= from zero to one to get the mean, and use the shortcut \(\sigma^{2}=\E X^{2}-\left(\E X\right)^{2}\) for the variance. 

#+latex: \end{example}

#+latex: \begin{example}
Let \(X\) have PDF \(f(x)=3/x^{4}\), \(x>1\). We may integrate the function \(xf(x)=\) =3/x^3= from zero to infinity to get the mean of \(X\).

#+begin_src R :exports both :results output pp 
g <- function(x) 3/x^3
integrate(g, lower = 1, upper = Inf)
#+end_src

#+results[e48698e6f52151a31bca9666dd8b87b4832c5a3c]:
: 1.5 with absolute error < 1.7e-14

Compare this to the answer we got in Example \ref{exa:cont-pdf-3x4}. Use =-Inf= for \(-\infty\).

#+latex: \end{example}

#+latex: \begin{example}
Let us redo Example \ref{exa:cont-pdf3x2} with the =distr= package. The method is similar to that encountered in Section \ref{sub:disc-rv-how-r} in Chapter \ref{cha:Discrete-Distributions}. We define an absolutely continuous random variable:
#+begin_src R :exports none :results silent
library(distr)
library(distrEx)
#+end_src

#+begin_src R :exports both :results output pp
library(distr)
f <- function(x) 3*x^2
X <- AbscontDistribution(d = f, low1 = 0, up1 = 1)
p(X)(0.71) - p(X)(0.14)
#+end_src

Compare this to the answer we found earlier. Now let us try expectation with the =distrEx= package \cite{Ruckdescheldistr}:
#+begin_src R :exports both :results output pp 
library(distrEx)
E(X); var(X); 3/80
#+end_src

Compare these answers to the ones we found in Example \ref{exa:cont-pdf3x2}. Why are they different? Because the =distrEx= package resorts to numerical methods when it encounters a model it does not recognize. This means that the answers we get for calculations may not exactly match the theoretical values. Be careful.
#+latex: \end{example}

